W7D1/cats99_part_2/app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "Snw-hrNshglnZ_LVgerKWeYPmin7D-XKZ6sbuWbiUhE"], ["id", 2]]