W6D4/ArtShareAPI/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 48]]
---
    def create
        @artwork_shares = ArtworkShare.new(params.require(:artwork_share).permit(:artwork_id, :viewer_id))
        if @artwork_shares.save