W6D4/ArtShareAPI/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = '45' OR artwork_shares.viewer_id = '45')
---
    def index
        @artworks = Artwork
                        .left_outer_joins(:artwork_shares)
                        .where("artworks.artist_id = ? OR artwork_shares.viewer_id = ?", params[:user_id], params[:user_id])
                        .distinct("artworks.id")

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Stick figure"], ["image_url", "stickfigure.com"], ["artist_id", 46]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save