W7D1/cats99_part_2/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["user_name", "test"], ["password_digest", "$2a$12$TEMdS0zzesvOEhJKYGlA9ODaDw3QKvp0TVP1Uz9CKpFCCZt4ObFcS"], ["session_token", "PC2PkqcUfu0H-HrhWsCS8S9hEXzvY8qdkhQP0IZ1F4M"]]
---
    def create
        @user = User.new(user_params)
        if @user.save